{
    "api_callback.component": {
        "description": "The Request direct callback component enables callbacks to be requested via Application Programming Interface (API) scenarios. The Request direct callback can be made to:\nA phone number previously defined in the Studio flow.\nAn extension number; this means the callback is going to be performed on the previously defined phone number + extension.When the Request direct callback request comes in, the agent can answer or reject the request the same way they would do with an incoming call. Talkdesk will then automatically call the number specified for the callback request. If the callback is answered, an agent will be joining the call."
    },
    "api_request.component": {
        "description":""
    },
    "assign_agent_pool.component": {
        "description": ""
    },
    "assignment_and_dial.component": {
        "description": "With the Assignment and dial component, you can decide how to assign a voice interaction to a group of Agents based on selected ring groups, attributes, or individual agent selection. Please note that all assignment types are mutually exclusive and that you can only select one of them per assignment component.Normally, you should use the Assignment and Dial component to route the call to ring groups or agents.Only when you want to route the call to a specific agent, even if the agent is already on a call, should you use the Dial Agent component."
    },
    "auto-answer.component": {
        "description": "With Studio, you can customize your agents` experience by enabling or disabling Auto-answer at the flow level.When enabled, the calls will be automatically answered within the timeout defined in the \"Timeout in seconds\" field."
    },
    "begin_module.component": {
        "description": "The \"Begin module\" component is the first step of the Module definition.This component will be automatically added to the canvas when you select Create Module on the Modules page. From there, you can start configuring your Module."
    },
    "calendar_based_rules.component": {
        "description": "In the calendar-based rules component you can not only define holidays and route calls accordingly, but also select a specific routing for the days when the expected number of calls differs significantly (e.g., Black Friday).If you want to allow routing according to time rages in a day, you need to use time based rules component."
    },
    "callback.component": {
        "description": "The Request Callback from queue component enables the callers to be called back later without losing their place in the assignment queue. The callback can be made to:\nThe original number.\nAnother phone number (defined previously in the flow).\nAn extension number; this means the caller is going to be called back on the original number + extension number.\nAccording to the flow definition, the Request Callback from Queue component should be added after defining a message informing the callers they can request the callback (this can be done on the waiting message of the A&D or by using a play message, for example).\nWhen the caller hears the message and presses the key for the callback option, they will listen to the message defined in the “Request successful” field of the “Request Callback from Queue” component, and the call is hung up. If the request was unsuccessful (an error occurred during the request), the caller will hear the “Error in request” message and the call is also hung up.\nCallbacks in Studio will also have a priority level associated, which will make a comparison between it and other waiting calls and decide the place in the queue for the request. Call priority outweighs any queue time, i.e., if a call with priority 10 has been in the queue for 30 minutes when a call with priority 1 comes in, the call with priority 1 will be handled first.\nThe agent is presented with a screen pop with the caller's information: name, phone number, callback request time, which queue the caller was waiting in, and which phone number was dialed.\nCustomers will only remain in the waiting queue up to the limit defined in the component. If the time defined to wait for an available agent is reached, and there are no available agents, the call will exit the waiting queue. By default, customers will not receive a message informing them of the timeout, but it can be set at the component level. This message will be played to the customer in case there`s a timeout, agents don`t pick up, or there`s an error."
    },
    "conditional_statement.component": {
        "description": "With the Conditional statement component you can direct a call to one of several exits. Each exit has its own condition(s).The exits are evaluated in order, so the call is directed to the first one whose conditions are met. If no condition is met, the \"No Match\" exit is taken."
    },
    "dial_dedicated_agent.component": {
        "description": "With the Dial Agent component, you can give your agents the option of managing multiple calls simultaneously, allowing them to accept incoming calls while placing the current call on hold. By enabling the Call Waiting feature, you can deliver direct calls to the agent regardless of whether they are on green, yellow, or red status.\nAlthough the purpose of the Dial Agent component is to assign a call to an agent, its use differs from the Assignment and Dial component.\nThe Assignment and Dial component will queue the call until the defined assignment preferences are met and does not allow for an incoming call to ring an agent when they are already in a call. The Dial Agent allows multiple call handling, since it enables an incoming call to ring the agent, even if the agent is already on a call.\nWith the Dial Agent Talkdesk Studio component, you can deliver direct calls to the agent regardless if it is on green, yellow, or red status, enabling the Call Waiting feature. This will give them the option of managing multiple calls simultaneously, allowing them to accept incoming calls while placing the current call on hold.Normally, you should use the Assignment and Dial component to route the call to ring groups or agents.Only when you want to route the call to a specific agent even if the agent is already on a call, or if the user explicitly mentions the need for the dedicated call, should you use the Dial Agent component."
    },
    "end_flow.component": {
        "description": "The function of the End flow component is to terminate the flow execution and to disconnect a call if one is in progress. The step editor is unavailable on this component, and it is not possible to define Preferences nor Exits."
    },
    "estimated_waiting_time.component": {
        "description": "The Estimated waiting time (EWT) component retrieves an estimate of the average time a ring group takes to answer a call. The average time is calculated according to the calls that the ring group answered in the last 10 minutes. If no call is answered during that period, the EWT cannot be calculated.The EWT has the following characteristics:\nIt's retrieved in seconds.\nIt can be used multiple times within the same flow.\n It can be placed on every single point of the flow.\nThe EWT value takes into consideration the time the caller has spent in the waiting queue."
    },
    "forward_to_external_number.component": {
        "description": "The Forward to external number component enables you to route the call to an external number."
    },
    "hang_up.component": {
        "description": "The function of the Hangup component is to disconnect the call to both the contact person and the agent.\nIf no optional exit is selected, the Hangup will be a final component, and the flow execution will terminate."
    },
    "incoming_call.component": {
        "description": "This is the initial component for incoming call flow definitions.If a blocklist of phone numbers has been configured at the account level, the component will take it into consideration.In case an incoming call from an unknown phone number reaches the “Incoming call”, a contact will be automatically created in Talkdesk. For more information on contact creation, please visit our Conversations page.Use the variables fields of the “Incoming call” component to expose data points such as the contact’s name, address, and phone details, among others.In this component, you can also make use of the User to User Information (UUI) SIP Header by mapping it into a variable and retrieving information from external systems to manage incoming calls and route them to the appropriate agents. Through UUI SIP Headers agents can get information about the caller, and the call destination, among other attributes."
    },
    "input_ivr.component": {
        "description": "The Input IVR component allows a caller to input data via the dial pad. This can be useful if new data is needed to make better routing decisions or to provide a better service, for example.Such as you can get the call number to set callback from the customer"
    },
    "make_outbound_call.component": {
        "description": "The Make outbound call component allows you to trigger an outbound call to a contact person in Studio flows, that are triggered by an API request."
    },
    "outgoing_call.component": {
        "description": "This is the initial component for outgoing call flow definitions.The outgoing call flow will be triggered when a manual outbound call is answered by the contact person. The agent who placed the call will be waiting in line to be connected to the contact person when the flow ends.Use the variables fields of the “Outgoing call” component to expose data points such as the contact’s name, address, and phone details, among others."
    },
    "play_audio.component": {
        "description": "The Play audio component allows you to configure an audio message.There are three ways of playing the target message: Text to Speech, Audio File Upload, and Other Sources."
    },
    "play_digits.component": {
        "description": ""
    },
    "record.component": {
        "description": "In the Record component you can determine whether you want to record a given interaction."
    },
    "reporting.component": {
        "description": "The Reporting component enables you to decide how a given interaction or contact is reported through ring groups.You can select the ring group from a list or consider a variable in the flow. For instance, the component allows you to use information collected from a CRM such as Salesforce for your call reporting.At interaction or call level, Talkdesk will surface the ring group(s) encountered in the last assignment and dial step and will include them in the “Tags” column in the calls report.At the contact level, if several contacts take place during an interaction, the “Calls Report” in “Explore” will consequently display several ring groups associated with the interaction, under the “Ring Group” column.With this component, data interpretation can be eased, since the “Calls Report” in Explore will only display the ring group that you decide to use during the assignment process.To configure the Reporting component properly, it is important that at least one Assignment and Dial, Callback or Voicemail component is used in the flow.Furthermore, if you wish to report by ring group, the component only allows the selection of a single ring group in the “Ring Group for reporting” field to make sure your interaction/contacts are reported on a single queue.Depending on the position chosen to place the component in the flow, the component will have an impact when reporting either by interaction or by contacts."
    },
    "salesforce_data_dip.component": {
        "description": "If you are using Talkdesk for Salesforce, you can search for specific information in Salesforce with Salesforce Object Query Language (SOQL).On the other hand, if a SOQL query is defined in a given Salesforce step using a “contact_name” variable in which the name contains an apostrophe and the escape tag is not used, as shown in the example below, there will be an upstream error and your Studio flow might not work properly."
    },
    "standard_ivr.component": {
        "description": "The Standard IVR component enables the contact person to select one of multiple options. Based on the selection that is made, the interaction will then follow the most appropriate path and can be routed to the most suited agent or group of agents within a team.you can choose one of the following message types: Text to speech, Audio file upload or Other sources."
    },
    "time_based_rules.component": {
        "description": "Define the time-based rules to allow routing according to time ranges or to any day(s) of the week.On the Exits tab, you can configure several exits to allow routing according to time-based rules. These rules will only apply to the phone numbers associated with the flow.Timezone​: Define to which timezone the rule will be applied.Time range​: The options​ allow you to define whether specified times represent business hours or non-business hours in reporting. Note: You must select the option \"Report as: Inside Business Hours\", and configure the respective hours, so that the calls are reported as \"Inside Business Hours\". In case the time ranges you are defining are incompatible, (for example, if the “To” time occurs before the “From” time), a warning message will be displayed. In addition, please be aware that whenever an overnight time range is defined, Studio will consider the following day of the week for the overnight time range, so the calls will be routed through the desired exit from, for example, 9:00 pm of a given day until 2:00 am of the following day. Note: The system doesn't route calls based on this parameter. You must still use the Send to menu to define where calls will be sent.Add time range: ​Add more time ranges to the previously defined ones."
    },
    "traffic_splitter.component": {
        "description": "This component enables you to split your incoming calls into routes of your choice."
    },
    "voice_ivr.component": {
        "description": "The Voice IVR component is a component with voice capabilities. You can use it to let your customers explain, in a few words, why they are calling your contact center.You can configure the keywords that are most likely to be used by callers and make routing decisions based on this."
    },
    "voice_transcription.component": {
        "description": "The Voice transcription component enables you to:\nTurn voice into text and send the information to Conversations.\nUse a Conditional Statement to make routing decisions based on the words uttered by the caller."
    },
    "voicemail.component": {
        "description": "This component routes the call to the voicemail of agents or ring groups you select. No context is given before the beep, so we recommend configuring an audio message (Play Audio component) right before the flow reaches Voicemail.Voicemail is a final component, therefore, no Exits are available.Here you can assign voicemails to specific agents or ring groups. Alternatively, you can use your preconfigured variables which will assign voicemail to agents/ring groups according to the previous events of your call flow. If your selection falls under the “Agents” assignment category, the variable to use will have to correspond to the agent`s email."
    },
    "whisper.component": {
        "description": ""
    },
    "run_function.component": {
        "description": "In a Studio flow, the Run function component is used to map a task based on custom, preconfigured JavaScript code that will execute a specific action, thus improving both call routing and agents` efficiency."
    }
}
